Robothaler/SolarControl/sdkconfig.defaults
# sdkconfig.defaults for ESP32-PoolMaster (ESP32-S3, Matter over Wi-Fi)
# Used only by matter_serial / matter_ota environments (framework = espidf, arduino).
# Regular arduino-only environments (serial_upload, OTA_upload) ignore this file.

# ── Target ─────────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ── Flash ──────────────────────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHMODE="qio"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── Bootloader: App-Validierung ────────────────────────────────────────────────
# Wenn esptool verify-flash für ota_0 OK ist, der 2nd-stage-Bootloader aber weiter
# "esp_image: Checksum failed" meldet, liegt ein Edge-Case zwischen Image-Erzeugung
# und Bootloader-Prüfung vor (nicht "leeres factory" — das ist weiterhin 0xFF nach Erase).
# Für Entwicklung: Validierung überspringen. Für Produktion entfernen; nie mit Secure Boot kombinieren.
CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS=y

# ── PSRAM (8MB OPI/Octal) ──────────────────────────────────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
# Route WiFi/LwIP dynamic buffers to PSRAM (saves ~30–40KB internal RAM)
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ── ESP32-S3 Instruction Cache / IRAM balance ──────────────────────────────────
# S3 Bank 0 = 48KB split between I-Cache and IRAM:
#   32KB cache → 16KB IRAM  (default, leads to 100% IRAM usage with Matter)
#   16KB cache →  32KB IRAM  ← use this; SPIRAM_FETCH_INSTRUCTIONS compensates the smaller cache
CONFIG_ESP32S3_INSTRUCTION_CACHE_16KB=y

# ── Arduino compatibility ───────────────────────────────────────────────────────
CONFIG_AUTOSTART_ARDUINO=y
CONFIG_ARDUINO_SELECTIVE_COMPILATION=y
# Disable heavy Arduino subsystems not needed
CONFIG_ARDUINO_SELECTIVE_ArduinoBLE=n
CONFIG_ARDUINO_SELECTIVE_SimpleBLE=n
CONFIG_ARDUINO_SELECTIVE_WiFiProv=n
CONFIG_ARDUINO_SELECTIVE_RainMaker=n
CONFIG_ARDUINO_SELECTIVE_Insights=n
CONFIG_ESP_INSIGHTS_ENABLED=n
CONFIG_ARDUINO_SELECTIVE_Zigbee=n
CONFIG_ARDUINO_SELECTIVE_ESP_SR=n
CONFIG_ARDUINO_SELECTIVE_ESP_I2S=n
CONFIG_ARDUINO_SELECTIVE_Matter=n
# HTTPClient fails to compile with GCC 14.2 / arduino-esp32 3.3.6:
# emplace_back(String&, String&) has no matching constructor in RequestArgument.
# Not used by this project (WebUI uses ESPAsyncWebServer, OTA uses espota).
CONFIG_ARDUINO_SELECTIVE_HTTPClient=n

# ── FreeRTOS ───────────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# ── Bluetooth (BLE) für Matter-Commissioning aktiviert ───────────────────────
# Matter-Commissioning via CHIPoBLE: BLE wird nur während des Pairings benötigt
# und nach erfolgreichem Commissioning automatisch heruntergefahren (kein
# Dauer-Stromverbrauch, kein Dauer-RAM-Bedarf).
#
# WICHTIG: BLE-Controller-Init und WiFi-PHY-Init laufen beim Boot kurz parallel
# und ziehen einen ~600 mA Stromspike. Ohne ausreichenden Stütz-Kondensator
# (≥470 µF Low-ESR + 100 nF Keramik) am 3V3-Pin des Moduls fällt die Spannung
# unter ~2,5 V und der HW-Brownout-Detektor löst aus → Boot-Loop.
# Vor dem Aktivieren prüfen, dass der Cap verbaut ist!
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
# BLE-Only-Modus (S3 hat ohnehin kein Classic-BT)
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
# Matter auf ESP32-S3 nutzt NimBLE als Host-Stack (nicht Bluedroid)
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
# Matter-over-BLE einschalten
CONFIG_ENABLE_CHIPOBLE=y
# BLE-Controller auf Core 0 pinnen (WiFi läuft auf Core 1, siehe oben)
CONFIG_BT_CTRL_PINNED_TO_CORE_0=y

# ── OpenThread — disabled (Wi-Fi only, no Thread border router) ────────────────
CONFIG_OPENTHREAD_ENABLED=n
CONFIG_OPENTHREAD_RADIO_NATIVE=n

# ── Wi-Fi ──────────────────────────────────────────────────────────────────────
CONFIG_ESP32_WIFI_ENABLED=y
CONFIG_ESP32_WIFI_TASK_PINNED_TO_CORE_1=y
CONFIG_ESP32_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP32_WIFI_NAN_ENABLE=n
# Disable AMPDU RX – removes the WIFI_RX_BA_WIN >= 2*STATIC_RX_BUFFER_NUM constraint
# and allows reducing static RX buffers without a build error.
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=n
# Static RX buffers live in internal DMA RAM even with SPIRAM_TRY_ALLOCATE_WIFI_LWIP.
# Cutting from the PSRAM-boosted default of 16 to 4 saves 12×1600 B = 19.2 KB of
# internal RAM, which is the headroom the BLE controller malloc_internal_wrapper needs.
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=4


# ── Matter / CHIP stack ────────────────────────────────────────────────────────
CONFIG_ESP_MATTER_NVS_USE_COMPACT_ATTR_STORAGE=y

# Matter Bridge: scale attribute/endpoint counts for 5 bridged devices
# (FiltrationPump, PhPump, ChlPump, SolarPump, HeatPump)
CONFIG_ESP_MATTER_MAX_DYNAMIC_ENDPOINT_COUNT=12

# ── NVS ───────────────────────────────────────────────────────────────────────
# NVS partition (64 KB) shared between PoolMaster config (~16 KB) and Matter (~32 KB)
CONFIG_NVS_ENCRYPTION=n

# ── Brownout detector ─────────────────────────────────────────────────────────
# Wieder aktiviert. Voraussetzung: Stütz-Kondensator (≥470 µF Low-ESR + 100 nF
# Keramik) am 3V3-Pin des Moduls ist verbaut, damit der Stromspike beim
# parallelen BLE+WiFi-PHY-Init keinen Spannungseinbruch unter ~2,5 V erzeugt.
# Threshold-Level 7 (Default auf S3) ≈ 2,51 V — niedrigere Schwelle ist HW-seitig
# nicht möglich. Die SW-Behandlung (Panic-Print + esp_restart) ist aktiv.
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
CONFIG_ESP_BROWNOUT_DET_LVL=7
# Bei Trigger ins Software-Panic gehen (statt direktem HW-Reset) — gibt im Log
# eine eindeutige "Brownout detector was triggered"-Zeile aus, bevor restartet
# wird. Erleichtert die Diagnose, falls der Cap doch nicht reicht.
CONFIG_ESP_SYSTEM_BROWNOUT_INTR=y

# ── Coredump (crash debugging) ────────────────────────────────────────────────
# Writes crash backtrace to the coredump flash partition (0xc20000, 72KB).
# Decode after crash: esptool read-flash 0xc20000 0x12000 coredump.bin
#   → python -m esp_coredump --chip esp32s3 info_corefile --core coredump.bin
#      --core-format raw .pio/build/matter_serial/firmware.elf
CONFIG_ESP_COREDUMP_ENABLE=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_MAX_TASKS_NUM=64
CONFIG_ESP_COREDUMP_TASK_STACK_SIZE=1024
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y

# ── Stack / heap tuning ────────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_CHIP_TASK_STACK_SIZE=16384

# FreeRTOS stack-overflow canary
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y


# ── Logging ───────────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# ── mbedTLS / heap ────────────────────────────────────────────────────────────
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
# HKDF required by Matter's CHIP crypto (CHIPCryptoPALmbedTLS.cpp calls mbedtls_hkdf)
CONFIG_MBEDTLS_HKDF_C=y

# ── HTTP-Server (WebUI + OTA) ─────────────────────────────────────────────────
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# ── Compiler ──────────────────────────────────────────────────────────────────
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
